-- 1 Выберите все заказы за 1990-03-10 из таблицы orders, упорядочив их по сумме в порядке возрастания
SELECT * FROM orders WHERE odate = '1990-03-10' ORDER BY amt;

-- 2 Выберите 2 последних заказа из таблицы orders
SELECT * FROM orders ORDER BY onum DESC LIMIT 2;

-- 3 Получите имена клиентов, рейтинг которых больше 200, город их проживания, а также имена продавцов, к которым относятся указанные клиенты. Используйте псевдонимы таблиц
-- 3 Получите имена клиентов, рейтинг которых больше 200, город их проживания, а также имена продавцов, к которым относятся указанные клиенты. Используйте псевдонимы таблиц
SELECT `c`.`cname`, `c`.`city`, `s`.`sname` from `customers` as `c`
JOIN `salers` as `s` on `c`.`snum` = `s`.`snum`
WHERE `c`.`rating`>200

-- 4 Выберите данные о максимальной сумме заказа таблицы orders
SELECT * FROM orders ORDER BY amt DESC LIMIT 1;

-- 5 Выберите имена продавцов (таблица salers), сумму каждой продажи продавцов (таблица orders) и подсчитанную сумму комиссионных с каждой конкретной продажи. Вывод сопроводите пояснениями, чтобы каждый ряд таблицы имел следующий вид: Продавец: | Rifkin | Сумма продажи: | 18.69 | Размер комиссионных: | 2.8035

SELECT "Продавец: " as "Продавец", s.sname as Saler, "Сумма продажи: " as "Сумма продажи", o.amt as Amount, "Размер комиссионных: " as "Размер комиссионных", o.amt*s.comm as Commision FROM salers as s
JOIN orders as o on s.snum = o.snum
